2025-12-28-once-csv-parser-to-rule-them-all.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.birkey.co/rss.xml"
      title="RSS feed for https://www.birkey.co/">
<title>Once csv parser to rule them all</title>
<link href="static/style.css" rel="stylesheet" type="text/css" />
	   <link rel="apple-touch-icon" sizes="180x180" href="static/apple-touch-icon.png">
	   <link rel="icon" type="image/png" sizes="32x32" href="static/favicon-32x32.png">
	   <link rel="icon" type="image/png" sizes="16x16" href="static/favicon-16x16.png">
	   <link rel="manifest" href="/site.webmanifest">
	   <link rel="mask-icon" href="static/safari-pinned-tab.svg" color="#5bbad5">
	   <link rel="alternate" type="application/rss+xml" title="RSS Feed for birkey.co" href="/rss.xml">
	   <meta name="author" content="Kasim Tuman">
	   <meta name="referrer" content="no-referrer">
	   <meta name="msapplication-TileColor" content="#da532c">
	   <meta name="theme-color" content="#ffffff">
	   <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
	   <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
	  </head>
<body>
<div id="preamble" class="status"><br><center>
       <div style="display: inline-block; vertical-align:middle;">
  <a href="https://www.birkey.co/index.html" style="text-decoration: none;"><b>BIRKEY CONSULTING</b><br>
  </a><hr/><div style="text-align: justify;display: inline-block; width: 100%;">
<a class="title" href="https://github.com/oneness">ABOUT</a> &nbsp;<a class="title" href="https://www.birkey.co/rss.xml">RSS</a> &nbsp;<a class="title" href="https://www.birkey.co/archive.html">ARCHIVE</a></div></div>
  </center><br><br>
  <div style="margin-bottom: 3ch;text-transform: none;"></div></div>
<div id="content">
<div class="post-date">28 Dec 2025</div><h1 class="post-title"><a href="https://www.birkey.co/2025-12-28-once-csv-parser-to-rule-them-all.html">Once csv parser to rule them all</a></h1>
<p>
One would think that parsing CSV files is pretty straightforward until
you get bitten by all kinds of CSV files exists in the wild. Many
years ago, I have written a small CSV reader with following
requirements in mind:
</p>
<ul class="org-ul">
<li>Should not depend on any other code other than Clojure</li>
<li>Should allow me to control how I tokenize and transform lines</li>
<li>Should allow me to have complete controll over delimiting charactor
or charactors, file encoding, amount of lines to read and error
handling</li>
</ul>

<p>
The result is <a href="https://github.com/oneness/csvx">csvx</a>. I update it to work across Clojure and ClojureScript both in
NodeJS and browser environment. The entire code is less than 200 lines
including comments and blank lines. If you find yourself in need of a
csv reader with above requirements, you are welcome to steal the
code. Enjoy!
</p>
<div class="taglist"><a href="https://www.birkey.co/tags.html">Tags</a>: <a href="https://www.birkey.co/tag-clojure.html">Clojure</a> <a href="https://www.birkey.co/tag-clojurescript.html">ClojureScript</a> </div></div>
<div id="postamble" class="status"><br><center>
	      <div style="display: inline-block; vertical-align:middle;"></div></div>
</body>
</html>
